[{"PlayerID":"Banana","Teamname":"Newbee","Introduction":"Wang \"Banana\" Jiao is a Chinese support player currently playing for Newbee.\r\n\r\nBanana is a member of the first generation Chinese Dota players, who is a very experienced player.\r\n\r\nAt The International 2013 Banana's team TongFu placed 4th, claiming over $200,000 in prize money. A few weeks afterwards, Banana followed his former teammate Hao, moving from TongFu to iG.\r\n\r\nIn March 2014 he would leave iG to join most of his old teammates of TongFu in Newbee, replacing ZSMJ. At The International 2014 Banana and Newbee placed 1st.\r\n\r\nHe is a very solid player with decent skills which make him a great support for his teammates.","photo":"Banana.jpg"}, {"PlayerID":"BurNIng","Teamname":"Team DK","Introduction":"Xu \"BurNIng\" Zhilei is a retired professional Dota 2 player who is currently the coach of Team DK. He was regarded as one of the best and most experienced carry players in the world, winning several carry awards and international championships throughout the years.\r\n\r\nBurNIng grew up in Tongling, the Anhui Province east in China. He was introduced to DotA by his friends at the end of 2007. He started an online team called TTI and played a lot of public games.\r\nIt wasn't until October 2008 he first started playing DotA professionally when he was approached by CaNt's manager fashao to join the team CaNt.\r\n\r\nEarly in 2011 BurNIng and KingJ left the successful EHOME and joined Team DK. Rumors has it that Team DK provided much better financial support for their members than what EHOME did and that was one of the reasons for the switch.\r\n\r\nThe new team wasn't an immediate success. They got second place in G-League 2011 Season 1 and a third in ECL Season 2. The team expected more and it didn't take long until changes were made, bringing back BurNIng's former teammate LongDD. The team went on to win G-League 2011 Season 2, World DotA Championship 2011 and G-League 2011 Season 3.","photo":"Burning.jpg"}, {"PlayerID":"ChuaN","Teamname":"Invictus Gaming","Introduction":"Wong \"ChuaN\" Hock Chuan is a professional Dota 2 player who currently plays for Invictus Gaming. Well known for his Windranger and Mirana skills, ChuaN has a huge fan base in Asia.\r\n\r\nChuaN was born and raised in Kuala Lumpur, Malaysia. During his younger days he loved to play basketball, but later on in his career he had to quit playing because of an injury. After a while he picked up DotA and started playing it full-time. Now ChuaN is recognized as one of the best Malaysian\/Asian players.\r\n\r\n","photo":"Chuan.jpg"}, {"PlayerID":"DD","Teamname":"LGD Gaming","Introduction":"Xie \"DD\" Bin is a retired professional Chinese Dota 2 player for TongFu, who used to play for LGD Gaming.\r\n\r\n","photo":"DD.jpg"}, {"PlayerID":"DDC","Teamname":"LGD Gaming","Introduction":"Liang \"DDC\" Faming is a professional Macau Dota 2 player who currently plays for LV Gaming after leaving LGD Gaming.\r\n\r\nDotA\r\nLiang 'DDC' Faming was a member of team Catastrophic Cruel Memories which was bought by Invictus Gaming $6.2 million USD on the 9th of August, 2011.\r\n\r\nDotA 2\r\nDDC joined LGD Gaming in 2011 and as a team they took third place in The International 2012. Prior to that their biggest achievement was a first place finish in the Gigabyte Dota 2 Masters over Team Zenith winning USD $3,000.\r\n\r\nHe was in serious arguments with LGD Gaming manager, and he was kicked out of LGD Gaming without any information in advance. This scandal however does not affect both sides too much because DDC is a talented player who is welcomed by any team.","photo":"DDC.jpg"}, {"PlayerID":"Faith","Teamname":"Invictus Gaming","Introduction":"Zeng \"Faith\" Hongda is a professional Chinese Dota 2 player currently playing for LGD as a support after he left Invictus Gaming.\r\n\r\nComing from the province of Guangdong, Faith is a second generation Chinese Dota player. \r\n\r\nConsidring other team member in Invictus Gaming, Faith is not as famous as his teammates, which leads to the result that his voice would not be accepted in most circumstance. Together with the poor result of Invictus Gaming in Ti4 2014, he chose to leave Invictus Gaming.","photo":"Faith.jpg"}, {"PlayerID":"Fenrir","Teamname":"Vici Gaming","Introduction":"Lu \"Fenrir\" Chao currently plays the support role for and captains Vici Gaming.\r\n\r\nDespite of his age, he is a super new player in DotA2 area,and Vici Gaming is his first and up till now the only team he has served for. He is the captain of Vici Gaming at the moment while considered as the best couple of supports together with fy, his teammate.","photo":"Fenrir.jpg"}, {"PlayerID":"Ferrari_430","Teamname":"Invictus Gaming","Introduction":"Luo \"Ferrari_430\" Feichi is a professional dota player currently playing for Invictus Gaming as solo mid.\r\n\r\nAlso nicknamed \"The Pianist\".\r\nKnown to be one of the best Invoker players in the world.\r\nHad to add the \"430\" at the end of his id because Ferrari was already taken.\r\n\r\nThe most powerful solo mid player in the world, in other words no one can defeat him in the mid lane.","photo":"Ferrari.jpg"}, {"PlayerID":"fy","Teamname":"Vici Gaming","Introduction":"Xu \"fy\" Linsen is a professional Dota 2 player who plays the support role for Vici Gaming.\r\n\r\nfy is a new super star in DotA2 community who has very solid micro which is better than anyone u can mention. fy is playing as support at the moment but it is only because his teammates need such a brilliant support player. He is probably the best player now in the world, while also is the most successful new player during the entire DotA&DotA2 history.\r\n\r\nDespite playing primarily support for VG, Fy has won two 1v1 tournaments: The ECL 2013 Dota 2 Season 1v1 tournament in July 2013, beating the likes of ZSMJ, BurNIng, and cty, and the For a Few Tangoes More 1v1 tournament at The Summit 1 2014, beating amateur Excalibur and Funn1k.","photo":"fy.jpg"}, {"PlayerID":"Hao","Teamname":"Newbee","Introduction":"Chen \"Hao\" Zhihao is a professional player currently playing for Newbee.\r\n\r\nChen 'Hao' Zhihao, nicknamed General Hao by the Chinese community, is known to be one of the most aggressive players in the scene. Having joined teams such as Nirvana.cn, TyLoo, Pandarea, TongFu, iG and most currently Newbee, Hao is no stranger to LAN competitions and is also known to be extremely fervent during matches. As a carry player, he has the urge to kill which can be seen in games where he dives countless times for kills. His risky plays defines his character, and the polarizing rewards or setbacks from the outcome of his aggression can make or break the team that he plays in.\r\n\r\nHao has played in every The International, in 2011 with TyLoo (Placed 9-12th), in 2012 (Placed 7-8th) and 2013 with TongFu (Placed 4th) and in 2014 with Newbee (Placed 1st).\r\n\r\nThere is a nickname for Hao among the Chinese DotA players, \"Hao the Hand Cutter (砍手豪)\", because of the words he said once during a game: \"Pick Antimage for me, I will cut off my hand if we're not the winner.\"","photo":"Hao.jpg"}, {"PlayerID":"iceiceice","Teamname":"Team DK","Introduction":"Daryl Koh \"iceiceice\" Pei Xiang is a Singaporean player, who is currently a member of Vici Gaming after he left Team DK in late 2014. A famous DotA player who had notably won ESWC Paris and CAPL, iceiceice pursued a StarCraft II career in 2010 and early 2011 and switched to Dota 2 in 2011.\r\n\r\nIn August 2011, iceiceice made his first steps in the Dota 2 competitive scene as he attended The International 2011 with Scythe Gaming. iceiceice and his teammates eventually took third place at the event, losing to EHOME in the losers' bracket finals, and sharing a $150,000 prize. iceiceice later left Scythe Gaming and joined team Zenith.\r\n\r\nEven though Zenith had a disappointing finish at The International 2013, iceiceice won the 1 v 1 solo championship defeating Mushi and won himself the crown of being called the best solo mid in Dota 2. Zenith disbanded shortly after the conclusion of The International 2013, and so iceiceice was picked up by the Chinese Team DK to complete their new roster.","photo":"iceiceice.jpg"}, {"PlayerID":"LaNm","Teamname":"Team DK","Introduction":"Zhang \"LaNm\" Zhicheng is a retired professional Dota 2 player who most recently played for Team DK.\r\n\r\nLaNm participated at The International 2011 and The International 2012 together with EHOME. He was the last remaining player on the roster when the team disbanded for a second time.\r\n\r\nOn the 18th of January 2013, he was announced as part of RaTtLeSnAkE.\r\n\r\nAfter The International 2013 he was confirmed to have moved from RaTtLeSnAkE to Team DK with Mushi from Orange Esports, joining BurNIng and Dai.\r\n\r\nAfter The International 2014 he confirmed that he is leaving the professional scene and thanked everyone who supported him over the past years. ","photo":"lanm.jpg"}, {"PlayerID":"Lin","Teamname":"LGD Gaming","Introduction":"Xu \"Lin\" Ziyang is a professional Dota player currently playing for LV Gaming who used to play for LGD Gaming.\r\n\r\nLin is a member of the second generation Chinese Dota players.\r\n\r\nLin started his professional career by joining RattleSnake as a support player after Lanm and Kabu left the team. In April of 2014 he joined LGD Gaming as a sixth member before eventually becoming their full time mid player. He remained in this position under the Banner of LV Gaming.","photo":"lin.jpg"}, {"PlayerID":"Luo","Teamname":"Invictus Gaming","Introduction":"Luo \"Luo\" Yinqi currently plays for Invictus Gaming.\r\n\r\nLuo is a first generation Chinese Dota player.\r\n\r\nHe is well-known for taking a leadership role in his teams and for control of game pace, which got him the nickname \"Director Luo\".\r\n\r\nLuo first got into Dota 2 after he joined up with World Elite in early 2012. He and his squad were invited to participate in The International 2012 which would be World Elite's first official Dota 2 tournament. Despite knowing full well that this tournament was going to be filled with the best players in the world, Luo was the only player to practice Dota 2 prior to going to the event. Surprising to most, but unsurprising after hearing this explanation from the World Elite manager, WE had poor showing at The International 2012. Following the event, Luo and his teammates left World Elite one by one.\r\n\r\nLuo's next showing in Dota 2 comes with his current squad RaTtLeSnAkE. They have shown some strong performances together but have been unable to secure any championships yet. Their results were good enough to receive an invite to The International 2013 Eastern Qualifier Tournament.","photo":"luo.jpg"}, {"PlayerID":"Mu","Teamname":"Newbee","Introduction":"Zhang \"Mu\" Pan is the solo mid player for Newbee.\r\n\r\nMu is known for his high risk, high reward, yet calculated, playstyle in the mid lane.\r\n\r\nMu is probably the best teammate of Hao, and these 2 young men has fought together for their entire progaming career till now.\r\n\r\nIn 2012 Mu joined TongFu as their mid player, together with Hao and SanSheng, after leaving Pandarea. After winning the 2012 Eastern Qualifiers he placed 7\/8th at hist first The International 2012.\r\n\r\nAfter The International in 2012 TongFu would become one of the better teams in China, most notably winning Dota 2 Super League and getting an invite for The International 2013 after LGD Gaming got disqualified for roster changes. TongFu eventually placed 4th, the highest out of all Chinese teams.\r\n\r\nIn September 2013 Mu lost 3 of his teammates in a reshuffle of the big Chinese teams. However, in February 2014, Mu would be reunited with them in Newbee, where four people of the former TongFu squad, together with Xiao8, would become the new Chinese dream team.\r\n\r\nMu, still with Newbee, went on to win The International 2014, taking down Vici Gaming in spectacular style 3:1.\r\n\r\n","photo":"MU.jpg"}, {"PlayerID":"Mushi","Teamname":"Team DK","Introduction":"Chai \"Mushi\" Yee Fung is a professional player who most recently played for Team DK, having previously played for Orange as solo mid or carry, depending on which heroes the team picked.\r\n\r\nAlthough he is from Malaysia, he has reached his summit of DotA2 career in China.","photo":"Mushi.jpg"}, {"PlayerID":"Rabbit","Teamname":"LGD Gaming","Introduction":"Wang \"Rabbit\" Zhang is a professional Dota player currently playing for NewBee after he left LGD Gaming.\r\n\r\nRabbit is a member of the second generation Chinese Dota players.\r\n\r\nRabbit's first competitive team was when he joined Lord of Host in April 2012 filling the void left by Kssss and NEO. A month later, the team was acquired by Noah's Ark (NA). NA was invited to participate in the prestigious ACE League. Rabbit left the team in July. Before he left, he helped his team to a 4th place finish in StarsWar 7.","photo":"Rabbit.jpg"}, {"PlayerID":"rOtk","Teamname":"Vici Gaming","Introduction":"Bai \"rOtk\" Fan was a professional Dota player who last played for Vici Gaming before retiring.\r\n\r\nOtk played the offlane position for Team DK from August 2011 until August 2013. In September 2013 he joined Vici Gaming, where he took up the offlane position and captain's role. Vici Gaming then went on to win the RaidCall EMS One Fall Season Finals, their first premier championship, under ROtk's leadership. At The International 2014 Vici Gaming placed second, after which ROtk announced his retirement, together with BurNIng. They would move on to casting and promoting Dota 2 in China together.\r\n\r\nrOtk was famous for his insulting and taunting during offline tournaments which increased the morale of his team mates.Although this is not a good habit, he still got a lot of fans due to this.","photo":"rotk.jpg"}, {"PlayerID":"SanSheng","Teamname":"Newbee","Introduction":"Wang \"SanSheng\" Zhaohui is a support player for Newbee.\r\n\r\nSanSheng played in the 4 position for TongFu, placing 4th in The International 2013. Following the announcement of Zhou's retirement in early 2014, TongFu disbanded and SanSheng was left teamless. He was later picked up by Newbee on the 22nd April.\r\n\r\nA player whose skill is far more than the reputation he should have but this cannot stop him to become one of the most successful DotA2 player.","photo":"sansheng.jpg"}, {"PlayerID":"Super","Teamname":"Vici Gaming","Introduction":"Xie \"Super\" Junhao is a professional Dota player who plays for Vici Gaming.\r\n\r\nComing from the province of Guangdong, Yueru is a second generation Chinese Dota player.\r\n\r\nA solo mid player who ahs the same level skill as the widely-considered best mid player Ferrari_430.","photo":"super.jpg"}, {"PlayerID":"Sylar","Teamname":"Vici Gaming","Introduction":"Liu \"Sylar\" Jiajun is a professional Dota player used to play for Vici Gaming and currently playing for LGD.\r\n\r\nA relatively new player to the DotA scene, Sylar began his career in early 2011, joining World Elite. However, upon ZSMJ's departure from LGD and retirement from DotA in late 2011, Sylar left World Elite to join LGD.\r\n\r\nWhen it came into DotA2 generation, Sylar as a very new pro-gamer has gained considerable fans because of his steady farming skill and the runner-up result of Vici Gaming in TI4 2014 proves that he is one of the best carrier in the world.","photo":"Sylar.jpg"}, {"PlayerID":"X!!","Teamname":"Team DK","Introduction":"Lei \"X!!\" Zengrong is a professional Dota 2 player who plays for LGD.\r\n\r\nX!! is mainly known for his role as solo mid for EHOME during their domination in DotA in 2010.\r\n\r\nX!! popularized the Blink Dagger rush on Lion as a solo mid hero.\r\n\r\nAfter The International 2013, on August 29th, DK announced that they were rebuilding the team and that all players except for BurNIng were \"no longer affiliated with our organization\". However, just about a week later, the new squad was announced with X!! being a part of it.","photo":"X!!.jpg"}, {"PlayerID":"Xiao8","Teamname":"Newbee","Introduction":"Zhang \"Xiao8\" Ning is a retired professional Dota player, most recently the captain of Newbee.\r\n\r\nXiao8 begun his professional career in September 2010 playing in Dream alongside Yao, DD, Li and SJQ, which means he is one of the first generation Chinese DotA players and probably the most successful one.\r\n\r\nIn early 2011 Xiao8 joined Catastrophic Cruel Memories along with Zhou, Ferrari 430 and ddc. After some success Xiao8 and his teammates moved to Invictus Gaming in a $6 million deal. However the team failed to perform in The International 2011, and following a defeat to Tyloo at the World Cyber Games 2011 Xiao8 and ddc moved to LGD Gaming. In LGD Gaming Xiao8 played the offlane prior to and during The International 2012, but afterwards played the solo mid role, up until his departure from the team.\r\n\r\nXiao8 was then rumored to be part of a \"Chinese Dream Team\", and it was later confirmed that he was acquired, along with Hao, by Newbee for approximately $100,000 USD, joining KingJ, ZSMJ, and Mu. Xiao8 would start off in the support role, until ZSMJ and KingJ were replaced by Banana and Sansheng, delegating the offlane to Xiao8. This team would go on to win The International 2014, despite almost being eliminated in the group stages. On July 29th, Xiao8 announced his retirement on his Weibo.","photo":"Xiao8.jpg"}, {"PlayerID":"Yao","Teamname":"LGD Gaming","Introduction":"Yao \"Yao\" Zhengzheng is a professional Dota player who currently plays for LGD Gaming. He is known for his versatility.\r\n\r\nYao (previously known as XiaoD) began his professional career in September 2010 playing with Dream alongside DD, Xiao8, Li and Crystal. In early 2011 he took a break from competitive gaming due to study commitments, but later returned for a short period with Nirvana.cn.[1] During his time with Nirvana.cn he rotated between both a ganker and a support role.\r\n\r\nIn August 2011 Yao joined LGD Gaming alongside Xiao8, DDC and DD.[3] Prior to and during The International 2012 Yao played the solo mid position often as Invoker, Queen of Pain and Dragon Knight. Following TI2 he transitioned into the solo hardlane position, with Xiao8 taking over the solo mid. Occasionally Yao will return to the solo mid position, notably on Brewmaster.\r\n\r\nHe is the oldest player in LGD Gaming squad which shows the trust from LGD Gaming on him and he has gained several incredible victories for LGD Gaming.","photo":"Yao.jpg"}, {"PlayerID":"YYF","Teamname":"Invictus Gaming","Introduction":"Jiang \"YYF\" Cen is a professional Dota 2 player from China, who is currently playing for TongFu.OB, after leaving Invictus Gaming.\r\n\"YYF\"' is an abbreviation of \"Yue Ye Feng\", which refers to \"Maple in the Moonlight\" in Chinese.\r\n\r\nOriginally a member of LGD Gaming, YYF was recruited by Invictus Gaming in August 2011 along with his teammates ChuaN, 830 and ch, where they formed the line-up iG.Y. In November 2011, iG.Y and iG.Z merged into a single roster comprised of YYF, ChuaN, Faith, Ferrari 430 and Zhou. Invictus Gaming was invited in The International 2012, where they achieved a nearly flawless 13-1 record in the group stage and defeated Evil Geniuses in the playoffs first round, only to be sent into the loser's bracket by the reigning champion Natus Vincere. The roster nonetheless made it to the grand finals at the expense of EHOME, Team DK and LGD Gaming, and ultimately defeated Natus Vincere in order to secure the $1,000,000 champion's prize.\r\n\r\nOn July 24th, 2014, YYF announced his retirement on his Weibo.\r\n\r\n\r\nYYF is one of the best player in the entire DotA&DotA2 history, and it is very pity for the fans when he decided to retire at his most overwhelming time.","photo":"YYF.jpg"}]
