[{"TeamName":"Invictus Gaming","introduction":"Invictus Gaming is the result of Wanda Enterprise director Wang Sicong acquiring Catastrophic Cruel Memory. The team was founded in 2011 and has DotA, Starcraft 2, and LoL teams.\r\n\r\nThe team is managed by former Catastrophic Cruel Memory SC2 players xiaOt and GoMax.\r\n\r\nTheir teamhouse was located in Beijing, before they moved to Shanghai.","TeamMember1":"Ferrari_430","TeamMember2":"Faith","TeamMember3":"ChuaN","TeamMember4":"Luo","TeamMember5":"YYF","TeamLogo":"IG.png"}, {"TeamName":"LGD Gaming","introduction":"LGD Gaming is a Chinese multigaming team sponsored by Guizhou Laogandie Food. It has a Dota 2 division and one League of Legends division.\r\n\r\nTheir team house is based in Hangzhou, China.\r\n\r\nLGD began as For The Dream, which won SMM 2009, later that year FTD was sponsored by LGD. The team has been a powerhouse of the Chinese scene ever since. The team was struck hard during the great Chinese reshuffle[1] of 2011, when the team lost 4 of its players to Invictus Gaming. Despite the efforts of ZSMJ to rebuild, the team was unable to regain its former strength leading to the iconic carry to retire. He was replaced by Sylar, a move which eventually allowed them to regain their position as one of the leading teams in China.\r\n\r\n","TeamMember1":"DD","TeamMember2":"DDC","TeamMember3":"Lin","TeamMember4":"Yao","TeamMember5":"Rabbit","TeamLogo":"LGD.png"}, {"TeamName":"Newbee","introduction":"Newbee is a team that emerged in early 2014 during the Chinese reshuffle that happened prior to the fourth International tournament. Originally dubbed \"Dream Team 2\", the rumors started after captain xiao8 made a post on his QQ micro-blogging page after LGD Gaming's win in the Dota 2 League Season 4 in Las Vegas, saying \"New start in 2014 after 3 years in LGD\", forever Dream 5.\". The rumors later placed TongFu and Invictus Gaming members Mu, Faith, Hao and ChuaN in the team together with xiao8. A few weeks later, the team was announced to be competing in the third season of the Sina Cup, but the roster was not yet revealed. As Invictus Gaming had announced that Faith would be staying with the team, rumors now placed ZSMJ and Banana in the team. After TongFu announced on the 20th of February that the team would step down from the competitive tier and focus on the amateur scene, and Banana was announced to be staying in iG as a backup player, many now saw the veterans ZSMJ and KingJ as the last two members of the new \"Dream Team\". On the 23rd of February 2014, the Chinese ACE Dota organization announced that the transfers were complete and the now dubbed team \"Newbee\" consisted of xiao8, Mu, Hao, KingJ and ZSMJ. Later team Newbee announced on its QQ micro blogging page that the club was officially established on the 28th of February, and that a transfer fee of 500,000 RMB (~81,000 USD) had been agreed upon between the new club and xiao8's old team LGD Gaming.\r\n\r\nThe organization later also announced that former RisingStars player Sydm was part of the team in the role of coach, and former Noah's Ark player Li was the teams leader. Li is a veteran WC3 DotA player who played with xiao8, Yao, DD and DDC on team Dream, which may or may not have been the origin of the teams first rumored name Dream Team.","TeamMember1":"Hao","TeamMember2":"Mu","TeamMember3":"Banana","TeamMember4":"SanSheng","TeamMember5":"Xiao8","TeamLogo":"Newbee.png"}, {"TeamName":"Team DK","introduction":"Formed in 2010, Team DK, dubbed the \"Galacticos\" of the Chinese scene, is one of the strongest Chinese DotA teams.\r\n\r\n2014\r\nComing into 2014 Team DK managed to obtain their first premier Dota2 title in the WPC ACE League 2013 by defeating Invictus Gaming 4:3 in a monumental comeback after being 0:3 down in the Grand Final. DK went on to win Starladder Season 9, defeating Team Empire 3:0. They did not drop a single game in the offline finals.\r\n\r\nLaNm retired from professional Dota2 on July 22, 2014.BurNIng announced his retirement on August 17th. iceiceice, Mushi, and MMY left the squad on August 26th.","TeamMember1":"BurNIng","TeamMember2":"iceiceice","TeamMember3":"Mushi","TeamMember4":"LaNm","TeamMember5":"X!!","TeamLogo":"DK.png"}, {"TeamName":"Vici Gaming","introduction":"Vici Gaming was formed on the 21st of October, 2012 with the help of “Fengdidi”, who also had previously played in PanDarea Gaming under the name “PanPan”, handpicking highly skilled players that were high ranked on top of the Chinese DotA ladder at the time.\r\n\r\nThe players had no previous professional experience at the time with the exception of “sydm” who had played under the banner of TyLoo. Notably also their current mid lane player “Cty” had shown promise by winning a 1v1 tournament organized by “2009” in which he beat famous players like “Ferrari_430”, Sylar”, “Hao” and other top Chinese players shortly before getting recruited.\r\n\r\nThe team qualified for the 2012 G-League Season 2 by beating Noah's Ark in the preliminaries.\r\n\r\nOn January 28th, Vici signed Greedy, captained by the famous YaphetS as their online\/backup squad. The rest of the team consists of xiaotuji, Maybe, nL_Ks, and CaptainGiveMeBall. They are currently focused on Dota, though they plan to expand to Dota 2 in the near future.\r\n\r\nOn March 1st, Vici signed ZSMJ, who will be building a Dota 2 squad. It is believe that ZSMJ brought some of his teammates from his project with Chisbug with him to Vici Gaming, of which one is definitely Sgua_Li. In the following weeks, Vici Gaming made some roster adjustment, dropping some players in private while sending out a public notice for interested players to contact them.\r\n\r\nOn March 28th, It was announced that carry player ZSMJ replaced mid player sydm and that former carry Cty picked up the mid role.\r\n\r\nIn June 2013, following elimination from the The International 2013 qualifiers and a disappointing finish outside playoff places in DSL, Vici Gaming announced the departure of team executive, PandaPanPan, and team manager, Nada. There replacement was mikasa who occasionally plays as a substitute for VG.\r\n\r\nIn December 2013, Vici Gaming travel to Poland to compete in the Raidcall EMS Fall lan finals, joining the ranks of teams like Alliance, Navi and DK who were pioneers in east-west tournament participation. Following this the team also traveled to the Kingston HyperX Dota 2 League offline finals in Las Vegas in 2014. Vici would go on to take first place at EMS One Fall but would subsequently fall from the top of Dota 2 due to a lack of direction and poor player performances. Despite placing at many events Vici would not achieve another title in the TI3 to TI4 season.\r\n\r\nAt the end of April 2014 Vici Gaming was awarded a direct invite to The International 4 where they would go on to place first in the group stage and second overall.","TeamMember1":"Fenrir","TeamMember2":"fy","TeamMember3":"rOtk","TeamMember4":"Super","TeamMember5":"Sylar","TeamLogo":"VG.png"}]
